## Objective - Use pandas to collect and clean clean salary data to be saved in csv for later merging to other features.

In [ ]:
import pandas as pd 

from google.colab import drive

df = pd.read_html('https://mlsplayers.org/resources/salary-guide')

In [ ]:
len(df)

1

In [ ]:
df[0].head()

  First Name     Last Name  ...  Base Salary Guaranteed Compensation
0    Ilsinho           NaN  ...  $450,000.00             $501,250.00
1     Judson           NaN  ...  $360,000.00             $365,000.00
2       Auro           NaN  ...  $360,000.00             $388,750.00
3     Paxten      Aaronson  ...   $87,500.00              $91,500.00
4       Saad  Abdul-Salaam  ...  $125,000.00             $133,667.00

[5 rows x 6 columns]

In [ ]:
salary = df[0]

In [ ]:
salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 871 entries, 0 to 870
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   First Name               871 non-null    object
 1   Last Name                868 non-null    object
 2   Club                     871 non-null    object
 3   Position(s)              863 non-null    object
 4   Base Salary              871 non-null    object
 5   Guaranteed Compensation  871 non-null    object
dtypes: object(6)
memory usage: 41.0+ KB

In [ ]:
salary[:4]

  First Name Last Name  ...  Base Salary Guaranteed Compensation
0    Ilsinho       NaN  ...  $450,000.00             $501,250.00
1     Judson       NaN  ...  $360,000.00             $365,000.00
2       Auro       NaN  ...  $360,000.00             $388,750.00
3     Paxten  Aaronson  ...   $87,500.00              $91,500.00

[4 rows x 6 columns]

In [ ]:
salary['Last Name'].isna().value_counts()

False    868
True       3
Name: Last Name, dtype: int64

In [ ]:
salary['Last Name'].isna() = ' '

SyntaxError: ignored

In [ ]:
salary['Last Name'] = salary['Last Name'].fillna(' ')
salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 871 entries, 0 to 870
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   First Name               871 non-null    object
 1   Last Name                871 non-null    object
 2   Club                     871 non-null    object
 3   Position(s)              863 non-null    object
 4   Base Salary              871 non-null    object
 5   Guaranteed Compensation  871 non-null    object
dtypes: object(6)
memory usage: 41.0+ KB

In [ ]:
names = [salary['First Name']+ ' '+salary['Last Name']]
names[0]

0              Ilsinho
1               Judson
2                 Auro
3        Paxten Aaronson
4      Saad Abdul-Salaam
             ...
866          Kyle Zobeck
867          Rida Zouhir
868          Ethan Zubak
869        Dario Zuparic
870          Graham Zusi
Length: 871, dtype: object

In [ ]:
salary['name'] = names[0]
salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 871 entries, 0 to 870
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   First Name               871 non-null    object
 1   Last Name                871 non-null    object
 2   Club                     871 non-null    object
 3   Position(s)              863 non-null    object
 4   Base Salary              871 non-null    object
 5   Guaranteed Compensation  871 non-null    object
 6   name                     871 non-null    object
dtypes: object(7)
memory usage: 47.8+ KB

In [ ]:


# Mount your Drive to the Colab VM.
drive.mount('/gdrive')

# Write the DataFrame to CSV file.
with open('/gdrive/My Drive/data/player_salary.csv', 'w') as f:
  salary.to_csv(f)

Drive already mounted at /gdrive; to attempt to forcibly remount, call drive.mount("/gdrive", force_remount=True).

In [ ]:
names_df[:15]

                  Name
0                  NaN
1                  NaN
2                  NaN
3      Paxten Aaronson
4    Saad Abdul-Salaam
5     Luciano Abecasis
6          Ramon Abila
7       Lalas Abubakar
8          David Accam
9      Nicolas Acevedo
10  Ifunanyachi Achara
11       Kellyn Acosta
12      Luciano Acosta
13        Bryan Acosta
14       George Acosta